Revit 2024 API
ExtElemChangeBeamSectionRegistry Class
 An object that stores IExtElemChangeBeamSection
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class ExtElemChangeBeamSectionRegistry : IDisposable
Visual Basic
Public Class ExtElemChangeBeamSectionRegistry _
	Implements IDisposable
Visual C++
public ref class ExtElemChangeBeamSectionRegistry : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry
See Also
ExtElemChangeBeamSectionRegistry Members
Autodesk.Revit.DB.Structure Namespace